#include <iostream>
using namespace std;
int main() {
	//If24. Для данного вещественного x найти значение следующей функции f,
	//принимающей вещественные значения : f (x) = 2·sin(x), если x > 0,
	//6 − x, если x ≤ 0.
	/*double x;
	cin >> x;
	if (x > 0) {
		x = 2 * sin(x);
	}
	if (x <= 0) {
		x = 6 - x;
	}
	cout << x << endl;*/
	/*If25.Для данного целого x найти значение следующей функции f, принимающей значения целого типа :
	f(x) = 2·x, если x < −2 или x > 2,
		−3·x, в противном случае.*/
	/*int x;
	cin >> x;
	if (x <-2 || x>2) {
		x = 2 * x;
	}
	else  {
		x = -3 * x;
	}
	cout << x << endl;
	*/
}